Repository: OctoPrint/OctoPrint-FirmwareCheck
Catalog: octoprint_firmware_check/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Attention!
de: Achtung!

source: Allows to see firmware check warnings
de: Erlaubt die Anzeige von Firmwarecheckwarnungen

source: Without this plugin OctoPrint will no longer be able to check if the printer it is connected to has a known safety issue or otherwise broken firmware and inform you about that fact.
de: Ohne dieses Plugin wird OctoPrint nicht länger in der Lage sein, dich über bekannte Sicherheitsprobleme oder andere Probleme mit der Firmware deines Druckers zu informieren.

source: Your printer's firmware is known to have a broken implementation of the communication protocol. This will cause print failures. You'll need to take additional steps for OctoPrint to work with it.
de: Die Firmware deines Druckers is bekannt dafür, eine defekte Implementierung des Kommunikationsprotokolls zu haben. Das wird fehlerhafte Druckjobs verursachen. Du musst zusätzliche Schritte durchführen, damit OctoPrint damit arbeiten kann.

source: Your printer's firmware is known to lack mandatory safety features (e.g. thermal runaway protection). This is a fire risk.
de: Die Firmware deines Druckers ist bekannt dafür, obligatorische Sicherheitsfunktionen deaktiviert zu haben (z.B. Thermal Runaway Protection). Das ist ein Brandrisiko.

source: Critical Warning: Firmware Unsafe
de: Kritische Warnung: Unsichere Firmware

source: Warning: Firmware Broken
de: Warnung: Defekte Firmware

source: Critical Warning
de: Kritische Warnung

source: Warning
de: Warnung

source: Learn more...
de: Mehr erfahren...

source: Your printer's firmware is known to have a broken implementation of the communication protocol. This may cause print failures or other annoyances. You'll need to take additional steps for OctoPrint to fully work with it.
de: Die Firmware deines Druckers is bekannt dafür, eine defekte Implementierung des Kommunikationsprotokolls zu haben. Das kann fehlerhafte Druckjobs verursachen. Du musst zusätzliche Schritte durchführen, damit OctoPrint damit arbeiten kann.

source: Your printer's firmware is a {buildtype} build of {firmware} (build date {builddate}). It might be more unstable than a release version and should be kept up-to-date.
de: Deine Firmware ist ein {buildtype} Build von {firmware} (Builddatum {builddate}). Sie könnte instabiler sein als eine Releaseversion und sollte aktuell gehalten werden.

source: Your printer's firmware supports host action commands, but they are disabled. The firmware will not inform OctoPrint about job pause & cancellations, filament runouts, and similar firmware-side events. If you want this functionality, you need to change your firmware's configuration.
de: Die Firmware deines Druckers unterstützt Host Action Commands, sie sind jedoch deaktiviert. Die Firmware wird OctoPrint nicht über Job-Pausen und -Abbrüche, Filament Runouts und ähnliche firmwareseitige Ereignisse informieren. Falls du diese Funktionalität willst, musst du deine Firmwarekonfiguration ändern.

source: Disable warnings of severity "info"
de: Deaktiviere Warnungen der Schwere "Info"

source: Check this to disable warnings from firmware checks that are only of informational "heads-up" nature, like running a firmware development build.
de: Aktiviere dies um Warnungen von Firmwarechecks zu deaktivieren, die nur der Information dienen, wie z.B. die Nutzung eines Firmware Development Builds.

source: Disable firmware checks of severity "Info"
de: Deaktivere Firmware Checks der Schwere "Info"
